"""Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
Каждое слово состоит из латинских букв в нижнем регистре. Сделать вывод исходной строки, но каждое слово
должно начинаться с заглавной буквы. Необходимо использовать написанную ранее функцию int_func()."""

"""Вариант 1"""


def int_func(a1):
    return a1.title()


print(int_func(a1=str(input("Введите строку: "))))


"""Вариант 2"""


def int_func():
    print(input("Введите строку: ").title())


int_func()
